tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "olets/tap"
brew "astyle"
brew "chroma"
brew "clang-format"
brew "cmake"
brew "cpanminus"
brew "curl"
brew "fzf"
brew "git"
brew "jq"
brew "lazygit"
brew "python@3.12"
brew "llvm"
brew "neovim"
brew "node"
brew "ripgrep"
brew "ruby"
brew "rust"
brew "stow"
brew "uncrustify"
brew "vim"
brew "wget"
brew "zoxide"
brew "zsh"
brew "olets/tap/zsh-abbr"
brew "mas"
brew "gpg"
brew "poetry"
cask "battery"
cask "chatgpt"
cask "iterm2"
